apache/nuttx/arch/mips/src/pic32mz/hardware/pic32mz_int.h
/****************************************************************************
 * arch/mips/src/pic32mz/hardware/pic32mz_int.h
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

#ifndef __ARCH_MIPS_SRC_PIC32MZ_HARDWARE_INT_H
#define __ARCH_MIPS_SRC_PIC32MZ_HARDWARE_INT_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include "pic32mz_memorymap.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/
/* Register Offsets *********************************************************/

#define PIC32MZ_INT_INTCON_OFFSET     0x0000 /* Interrupt control register */
#define PIC32MZ_INT_INTCONCLR_OFFSET  0x0004 /* Interrupt control clear register */
#define PIC32MZ_INT_INTCONSET_OFFSET  0x0008 /* Interrupt control set register */
#define PIC32MZ_INT_INTCONINV_OFFSET  0x000c /* Interrupt control invert register */

#define PIC32MZ_INT_PRISS_OFFSET       0x0010 /* Priority shadow select register */
#define PIC32MZ_INT_PRISSCLR_OFFSET    0x0010 /* Priority shadow clear register */
#define PIC32MZ_INT_PRISSSET_OFFSET    0x0010 /* Priority shadow set register */
#define PIC32MZ_INT_PRISSINV_OFFSET    0x0010 /* Priority shadow invert register */

#define PIC32MZ_INT_INTSTAT_OFFSET    0x0020 /* Interrupt status register */
#define PIC32MZ_INT_INTSTATCLR_OFFSET 0x0024 /* Interrupt status clear register */
#define PIC32MZ_INT_INTSTATSET_OFFSET 0x0028 /* Interrupt status set register */
#define PIC32MZ_INT_INTSTATINV_OFFSET 0x002c /* Interrupt status invert register */

#define PIC32MZ_INT_IPTMR_OFFSET      0x0030 /* Interrupt proximity timer register */
#define PIC32MZ_INT_IPTMRCLR_OFFSET   0x0034 /* Interrupt proximity timer clear register */
#define PIC32MZ_INT_IPTMRSET_OFFSET   0x0038 /* Interrupt proximity timer set register */
#define PIC32MZ_INT_IPTMRINV_OFFSET   0x003c /* Interrupt proximity timer invert register */

#define PIC32MZ_INT_IFS_OFFSET(n)     (0x0040 + ((n) << 4))
#define PIC32MZ_INT_IFSCLR_OFFSET(n)  (0x0044 + ((n) << 4))
#define PIC32MZ_INT_IFSSET_OFFSET(n)  (0x0048 + ((n) << 4))
#define PIC32MZ_INT_IFSINV_OFFSET(n)  (0x004c + ((n) << 4))

#define PIC32MZ_INT_IFS0_OFFSET       0x0040 /* Interrupt flag status register 0 */
#define PIC32MZ_INT_IFS0CLR_OFFSET    0x0044 /* Interrupt flag status clear register 0 */
#define PIC32MZ_INT_IFS0SET_OFFSET    0x0048 /* Interrupt flag status set register 0 */
#define PIC32MZ_INT_IFS0INV_OFFSET    0x004c /* Interrupt flag status invert register 0 */

#define PIC32MZ_INT_IFS1_OFFSET       0x0050 /* Interrupt flag status register 1 */
#define PIC32MZ_INT_IFS1CLR_OFFSET    0x0054 /* Interrupt flag status clear register 1 */
#define PIC32MZ_INT_IFS1SET_OFFSET    0x0058 /* Interrupt flag status set register 1 */
#define PIC32MZ_INT_IFS1INV_OFFSET    0x005c /* Interrupt flag status invert register 1 */

#define PIC32MZ_INT_IFS2_OFFSET       0x0060 /* Interrupt flag status register 2 */
#define PIC32MZ_INT_IFS2CLR_OFFSET    0x0064 /* Interrupt flag status clear register 2 */
#define PIC32MZ_INT_IFS2SET_OFFSET    0x0068 /* Interrupt flag status set register 2 */
#define PIC32MZ_INT_IFS2INV_OFFSET    0x006c /* Interrupt flag status invert register 2 */

#define PIC32MZ_INT_IFS3_OFFSET       0x0070 /* Interrupt flag status register 3 */
#define PIC32MZ_INT_IFS3CLR_OFFSET    0x0074 /* Interrupt flag status clear register 3 */
#define PIC32MZ_INT_IFS3SET_OFFSET    0x0078 /* Interrupt flag status set register 3 */
#define PIC32MZ_INT_IFS3INV_OFFSET    0x007c /* Interrupt flag status invert register 3 */

#define PIC32MZ_INT_IFS4_OFFSET       0x0080 /* Interrupt flag status register 4 */
#define PIC32MZ_INT_IFS4CLR_OFFSET    0x0084 /* Interrupt flag status clear register 4 */
#define PIC32MZ_INT_IFS4SET_OFFSET    0x0088 /* Interrupt flag status set register 4 */
#define PIC32MZ_INT_IFS4INV_OFFSET    0x008c /* Interrupt flag status invert register 4 */

#define PIC32MZ_INT_IFS5_OFFSET       0x0090 /* Interrupt flag status register 5 */
#define PIC32MZ_INT_IFS5CLR_OFFSET    0x0094 /* Interrupt flag status clear register 5 */
#define PIC32MZ_INT_IFS5SET_OFFSET    0x0098 /* Interrupt flag status set register 5 */
#define PIC32MZ_INT_IFS5INV_OFFSET    0x009c /* Interrupt flag status invert register 5 */

#define PIC32MZ_INT_IEC_OFFSET(n)     (0x00c0 + ((n) << 4))
#define PIC32MZ_INT_IECCLR_OFFSET(n)  (0x00c4 + ((n) << 4))
#define PIC32MZ_INT_IECSET_OFFSET(n)  (0x00c8 + ((n) << 4))
#define PIC32MZ_INT_IECINV_OFFSET(n)  (0x00cc + ((n) << 4))

#define PIC32MZ_INT_IEC0_OFFSET       0x00c0 /* Interrupt enable control register 0 */
#define PIC32MZ_INT_IEC0CLR_OFFSET    0x00c4 /* Interrupt enable control clear register 0 */
#define PIC32MZ_INT_IEC0SET_OFFSET    0x00c8 /* Interrupt enable control set register 0 */
#define PIC32MZ_INT_IEC0INV_OFFSET    0x00cc /* Interrupt enable control invert register 0 */

#define PIC32MZ_INT_IEC1_OFFSET       0x00d0 /* Interrupt enable control register 1 */
#define PIC32MZ_INT_IEC1CLR_OFFSET    0x00d4 /* Interrupt enable control clear register 1 */
#define PIC32MZ_INT_IEC1SET_OFFSET    0x00d8 /* Interrupt enable control set register 1 */
#define PIC32MZ_INT_IEC1INV_OFFSET    0x00dc /* Interrupt enable control invert register 1 */

#define PIC32MZ_INT_IEC2_OFFSET       0x00e0 /* Interrupt enable control register 2 */
#define PIC32MZ_INT_IEC2CLR_OFFSET    0x00e4 /* Interrupt enable control clear register 2 */
#define PIC32MZ_INT_IEC2SET_OFFSET    0x00e8 /* Interrupt enable control set register 2 */
#define PIC32MZ_INT_IEC2INV_OFFSET    0x00ec /* Interrupt enable control invert register 2 */

#define PIC32MZ_INT_IEC3_OFFSET       0x00f0 /* Interrupt enable control register 3 */
#define PIC32MZ_INT_IEC3CLR_OFFSET    0x00f4 /* Interrupt enable control clear register 3 */
#define PIC32MZ_INT_IEC3SET_OFFSET    0x00f8 /* Interrupt enable control set register 3 */
#define PIC32MZ_INT_IEC3INV_OFFSET    0x00fc /* Interrupt enable control invert register 3 */

#define PIC32MZ_INT_IEC4_OFFSET       0x0100 /* Interrupt enable control register 4 */
#define PIC32MZ_INT_IEC4CLR_OFFSET    0x0104 /* Interrupt enable control clear register 4 */
#define PIC32MZ_INT_IEC4SET_OFFSET    0x0108 /* Interrupt enable control set register 4 */
#define PIC32MZ_INT_IEC4INV_OFFSET    0x010c /* Interrupt enable control invert register 4 */

