apache/nuttx/arch/mips/src/pic32mz/hardware/pic32mz_int.h
#define PIC32MZ_INT_IPC34_OFFSET      0x0360 /* Interrupt priority control register 34 */
#define PIC32MZ_INT_IPC34CLR_OFFSET   0x0364 /* Interrupt priority control clear register 34 */
#define PIC32MZ_INT_IPC34SET_OFFSET   0x0368 /* Interrupt priority control set register 34 */
#define PIC32MZ_INT_IPC34INV_OFFSET   0x036c /* Interrupt priority control invert register 34 */

#define PIC32MZ_INT_IPC35_OFFSET      0x0370 /* Interrupt priority control register 35 */
#define PIC32MZ_INT_IPC35CLR_OFFSET   0x0374 /* Interrupt priority control clear register 35 */
#define PIC32MZ_INT_IPC35SET_OFFSET   0x0378 /* Interrupt priority control set register 35 */
#define PIC32MZ_INT_IPC35INV_OFFSET   0x037c /* Interrupt priority control invert register 35 */

#define PIC32MZ_INT_IPC36_OFFSET      0x0380 /* Interrupt priority control register 36 */
#define PIC32MZ_INT_IPC36CLR_OFFSET   0x0384 /* Interrupt priority control clear register 36 */
#define PIC32MZ_INT_IPC36SET_OFFSET   0x0388 /* Interrupt priority control set register 36 */
#define PIC32MZ_INT_IPC36INV_OFFSET   0x038c /* Interrupt priority control invert register 36 */

#define PIC32MZ_INT_IPC37_OFFSET      0x0390 /* Interrupt priority control register 37 */
#define PIC32MZ_INT_IPC37CLR_OFFSET   0x0394 /* Interrupt priority control clear register 37 */
#define PIC32MZ_INT_IPC37SET_OFFSET   0x0398 /* Interrupt priority control set register 37 */
#define PIC32MZ_INT_IPC37INV_OFFSET   0x039c /* Interrupt priority control invert register 37 */

#define PIC32MZ_INT_IPC38_OFFSET      0x03a0 /* Interrupt priority control register 38 */
#define PIC32MZ_INT_IPC38CLR_OFFSET   0x03a4 /* Interrupt priority control clear register 38 */
#define PIC32MZ_INT_IPC38SET_OFFSET   0x03a8 /* Interrupt priority control set register 38 */
#define PIC32MZ_INT_IPC38INV_OFFSET   0x03ac /* Interrupt priority control invert register 38 */

#define PIC32MZ_INT_IPC39_OFFSET      0x03b0 /* Interrupt priority control register 39 */
#define PIC32MZ_INT_IPC39CLR_OFFSET   0x03b4 /* Interrupt priority control clear register 39 */
#define PIC32MZ_INT_IPC39SET_OFFSET   0x03b8 /* Interrupt priority control set register 39 */
#define PIC32MZ_INT_IPC39INV_OFFSET   0x03bc /* Interrupt priority control invert register 39 */

#define PIC32MZ_INT_IPC40_OFFSET      0x03c0 /* Interrupt priority control register 40 */
#define PIC32MZ_INT_IPC40CLR_OFFSET   0x03c4 /* Interrupt priority control clear register 40 */
#define PIC32MZ_INT_IPC40SET_OFFSET   0x03c8 /* Interrupt priority control set register 40 */
#define PIC32MZ_INT_IPC40INV_OFFSET   0x03cc /* Interrupt priority control invert register 40 */

#define PIC32MZ_INT_IPC41_OFFSET      0x03d0 /* Interrupt priority control register 41 */
#define PIC32MZ_INT_IPC41CLR_OFFSET   0x03d4 /* Interrupt priority control clear register 41 */
#define PIC32MZ_INT_IPC41SET_OFFSET   0x03d8 /* Interrupt priority control set register 41 */
#define PIC32MZ_INT_IPC41INV_OFFSET   0x03dc /* Interrupt priority control invert register 41 */

#define PIC32MZ_INT_IPC42_OFFSET      0x03e0 /* Interrupt priority control register 42 */
#define PIC32MZ_INT_IPC42CLR_OFFSET   0x03e4 /* Interrupt priority control clear register 42 */
#define PIC32MZ_INT_IPC42SET_OFFSET   0x03e8 /* Interrupt priority control set register 42 */
#define PIC32MZ_INT_IPC42INV_OFFSET   0x03ec /* Interrupt priority control invert register 42 */

#define PIC32MZ_INT_IPC43_OFFSET      0x03f0 /* Interrupt priority control register 43 */
#define PIC32MZ_INT_IPC43CLR_OFFSET   0x03f4 /* Interrupt priority control clear register 43 */
#define PIC32MZ_INT_IPC43SET_OFFSET   0x03f8 /* Interrupt priority control set register 43 */
#define PIC32MZ_INT_IPC43INV_OFFSET   0x03fc /* Interrupt priority control invert register 43 */

#define PIC32MZ_INT_IPC44_OFFSET      0x0400 /* Interrupt priority control register 44 */
#define PIC32MZ_INT_IPC44CLR_OFFSET   0x0404 /* Interrupt priority control clear register 44 */
#define PIC32MZ_INT_IPC44SET_OFFSET   0x0408 /* Interrupt priority control set register 44 */
#define PIC32MZ_INT_IPC44INV_OFFSET   0x040c /* Interrupt priority control invert register 44 */

#define PIC32MZ_INT_IPC45_OFFSET      0x0410 /* Interrupt priority control register 45 */
#define PIC32MZ_INT_IPC45CLR_OFFSET   0x0414 /* Interrupt priority control clear register 45 */
#define PIC32MZ_INT_IPC45SET_OFFSET   0x0418 /* Interrupt priority control set register 45 */
#define PIC32MZ_INT_IPC45INV_OFFSET   0x041c /* Interrupt priority control invert register 45 */

#define PIC32MZ_INT_IPC46_OFFSET      0x0420 /* Interrupt priority control register 46 */
#define PIC32MZ_INT_IPC46CLR_OFFSET   0x0424 /* Interrupt priority control clear register 46 */
#define PIC32MZ_INT_IPC46SET_OFFSET   0x0428 /* Interrupt priority control set register 46 */
#define PIC32MZ_INT_IPC46INV_OFFSET   0x042c /* Interrupt priority control invert register 46 */

#define PIC32MZ_INT_IPC47_OFFSET      0x0430 /* Interrupt priority control register 47 */
#define PIC32MZ_INT_IPC47CLR_OFFSET   0x0434 /* Interrupt priority control clear register 47 */
#define PIC32MZ_INT_IPC47SET_OFFSET   0x0438 /* Interrupt priority control set register 47 */
#define PIC32MZ_INT_IPC47INV_OFFSET   0x043c /* Interrupt priority control invert register 47 */

#define PIC32MZ_INT_OFF_OFFSET(n)   (0x0540 + ((n) << 2)
#define PIC32MZ_INT_OFF000_OFFSET    0x0540  /* Interrupt vector 0 address offset */
#define PIC32MZ_INT_OFF001_OFFSET    0x0544  /* Interrupt vector 1 address offset */
#define PIC32MZ_INT_OFF002_OFFSET    0x0548  /* Interrupt vector 2 address offset */
#define PIC32MZ_INT_OFF003_OFFSET    0x054c  /* Interrupt vector 3 address offset */
#define PIC32MZ_INT_OFF004_OFFSET    0x0550  /* Interrupt vector 4 address offset */
#define PIC32MZ_INT_OFF005_OFFSET    0x0554  /* Interrupt vector 5 address offset */
#define PIC32MZ_INT_OFF006_OFFSET    0x0558  /* Interrupt vector 6 address offset */
#define PIC32MZ_INT_OFF007_OFFSET    0x055c  /* Interrupt vector 7 address offset */
#define PIC32MZ_INT_OFF008_OFFSET    0x0560  /* Interrupt vector 8 address offset */
#define PIC32MZ_INT_OFF009_OFFSET    0x0564  /* Interrupt vector 9 address offset */
#define PIC32MZ_INT_OFF010_OFFSET    0x0568  /* Interrupt vector 10 address offset */
#define PIC32MZ_INT_OFF011_OFFSET    0x056c  /* Interrupt vector 11 address offset */
#define PIC32MZ_INT_OFF012_OFFSET    0x0570  /* Interrupt vector 12 address offset */
#define PIC32MZ_INT_OFF013_OFFSET    0x0574  /* Interrupt vector 13 address offset */
#define PIC32MZ_INT_OFF014_OFFSET    0x0578  /* Interrupt vector 14 address offset */
#define PIC32MZ_INT_OFF015_OFFSET    0x057c  /* Interrupt vector 15 address offset */

#define PIC32MZ_INT_OFF016_OFFSET    0x0580  /* Interrupt vector 16 address offset */
#define PIC32MZ_INT_OFF017_OFFSET    0x0584  /* Interrupt vector 17 address offset */
#define PIC32MZ_INT_OFF018_OFFSET    0x0588  /* Interrupt vector 18 address offset */
#define PIC32MZ_INT_OFF019_OFFSET    0x058c  /* Interrupt vector 19 address offset */
#define PIC32MZ_INT_OFF020_OFFSET    0x0590  /* Interrupt vector 20 address offset */
#define PIC32MZ_INT_OFF021_OFFSET    0x0594  /* Interrupt vector 21 address offset */
#define PIC32MZ_INT_OFF022_OFFSET    0x0598  /* Interrupt vector 22 address offset */
#define PIC32MZ_INT_OFF023_OFFSET    0x059c  /* Interrupt vector 23 address offset */
#define PIC32MZ_INT_OFF024_OFFSET    0x05a0  /* Interrupt vector 24 address offset */
#define PIC32MZ_INT_OFF025_OFFSET    0x05a4  /* Interrupt vector 25 address offset */
#define PIC32MZ_INT_OFF026_OFFSET    0x05a8  /* Interrupt vector 26 address offset */
#define PIC32MZ_INT_OFF027_OFFSET    0x05ac  /* Interrupt vector 27 address offset */
#define PIC32MZ_INT_OFF028_OFFSET    0x05b0  /* Interrupt vector 28 address offset */
#define PIC32MZ_INT_OFF029_OFFSET    0x05b4  /* Interrupt vector 29 address offset */
#define PIC32MZ_INT_OFF030_OFFSET    0x05b8  /* Interrupt vector 30 address offset */
#define PIC32MZ_INT_OFF031_OFFSET    0x05bc  /* Interrupt vector 31 address offset */

#define PIC32MZ_INT_OFF032_OFFSET    0x05c0  /* Interrupt vector 32 address offset */
#define PIC32MZ_INT_OFF033_OFFSET    0x05c4  /* Interrupt vector 33 address offset */
#define PIC32MZ_INT_OFF034_OFFSET    0x05c8  /* Interrupt vector 34 address offset */
#define PIC32MZ_INT_OFF035_OFFSET    0x05cc  /* Interrupt vector 35 address offset */
#define PIC32MZ_INT_OFF036_OFFSET    0x05d0  /* Interrupt vector 36 address offset */
#define PIC32MZ_INT_OFF037_OFFSET    0x05d4  /* Interrupt vector 37 address offset */
#define PIC32MZ_INT_OFF038_OFFSET    0x05d8  /* Interrupt vector 38 address offset */
#define PIC32MZ_INT_OFF039_OFFSET    0x05dc  /* Interrupt vector 39 address offset */
#define PIC32MZ_INT_OFF040_OFFSET    0x05e0  /* Interrupt vector 40 address offset */
#define PIC32MZ_INT_OFF041_OFFSET    0x05e4  /* Interrupt vector 41 address offset */
#define PIC32MZ_INT_OFF042_OFFSET    0x05e8  /* Interrupt vector 42 address offset */
#define PIC32MZ_INT_OFF043_OFFSET    0x05ec  /* Interrupt vector 43 address offset */
#define PIC32MZ_INT_OFF044_OFFSET    0x05f0  /* Interrupt vector 44 address offset */
#define PIC32MZ_INT_OFF045_OFFSET    0x05f4  /* Interrupt vector 45 address offset */
#define PIC32MZ_INT_OFF046_OFFSET    0x05f8  /* Interrupt vector 46 address offset */
#define PIC32MZ_INT_OFF047_OFFSET    0x05fc  /* Interrupt vector 47 address offset */

#define PIC32MZ_INT_OFF048_OFFSET    0x0600  /* Interrupt vector 48 address offset */
#define PIC32MZ_INT_OFF049_OFFSET    0x0604  /* Interrupt vector 49 address offset */
#define PIC32MZ_INT_OFF050_OFFSET    0x0608  /* Interrupt vector 50 address offset */
#define PIC32MZ_INT_OFF051_OFFSET    0x060c  /* Interrupt vector 51 address offset */
#define PIC32MZ_INT_OFF052_OFFSET    0x0610  /* Interrupt vector 52 address offset */
#define PIC32MZ_INT_OFF053_OFFSET    0x0614  /* Interrupt vector 53 address offset */
#define PIC32MZ_INT_OFF054_OFFSET    0x0618  /* Interrupt vector 54 address offset */
#define PIC32MZ_INT_OFF055_OFFSET    0x061c  /* Interrupt vector 55 address offset */
#define PIC32MZ_INT_OFF056_OFFSET    0x0620  /* Interrupt vector 56 address offset */
#define PIC32MZ_INT_OFF057_OFFSET    0x0624  /* Interrupt vector 57 address offset */
#define PIC32MZ_INT_OFF058_OFFSET    0x0628  /* Interrupt vector 58 address offset */
#define PIC32MZ_INT_OFF059_OFFSET    0x062c  /* Interrupt vector 59 address offset */
#define PIC32MZ_INT_OFF060_OFFSET    0x0630  /* Interrupt vector 60 address offset */
#define PIC32MZ_INT_OFF061_OFFSET    0x0634  /* Interrupt vector 61 address offset */
#define PIC32MZ_INT_OFF062_OFFSET    0x0638  /* Interrupt vector 62 address offset */
#define PIC32MZ_INT_OFF063_OFFSET    0x063c  /* Interrupt vector 63 address offset */

