apache/nuttx/arch/mips/src/pic32mz/hardware/pic32mz_int.h
#define PIC32MZ_INT_OFF064_OFFSET    0x0640  /* Interrupt vector 64 address offset */
#define PIC32MZ_INT_OFF065_OFFSET    0x0644  /* Interrupt vector 65 address offset */
#define PIC32MZ_INT_OFF066_OFFSET    0x0648  /* Interrupt vector 66 address offset */
#define PIC32MZ_INT_OFF067_OFFSET    0x064c  /* Interrupt vector 67 address offset */
#define PIC32MZ_INT_OFF068_OFFSET    0x0650  /* Interrupt vector 68 address offset */
#define PIC32MZ_INT_OFF069_OFFSET    0x0654  /* Interrupt vector 69 address offset */
#define PIC32MZ_INT_OFF070_OFFSET    0x0658  /* Interrupt vector 70 address offset */
#define PIC32MZ_INT_OFF071_OFFSET    0x065c  /* Interrupt vector 71 address offset */
#define PIC32MZ_INT_OFF072_OFFSET    0x0660  /* Interrupt vector 72 address offset */
#define PIC32MZ_INT_OFF073_OFFSET    0x0664  /* Interrupt vector 73 address offset */
#define PIC32MZ_INT_OFF074_OFFSET    0x0668  /* Interrupt vector 74 address offset */
#define PIC32MZ_INT_OFF075_OFFSET    0x066c  /* Interrupt vector 75 address offset */
#define PIC32MZ_INT_OFF076_OFFSET    0x0670  /* Interrupt vector 76 address offset */
#define PIC32MZ_INT_OFF077_OFFSET    0x0674  /* Interrupt vector 77 address offset */
#define PIC32MZ_INT_OFF078_OFFSET    0x0678  /* Interrupt vector 78 address offset */
#define PIC32MZ_INT_OFF079_OFFSET    0x067c  /* Interrupt vector 79 address offset */

#define PIC32MZ_INT_OFF080_OFFSET    0x0680  /* Interrupt vector 80 address offset */
#define PIC32MZ_INT_OFF081_OFFSET    0x0684  /* Interrupt vector 81 address offset */
#define PIC32MZ_INT_OFF082_OFFSET    0x0688  /* Interrupt vector 82 address offset */
#define PIC32MZ_INT_OFF083_OFFSET    0x068c  /* Interrupt vector 83 address offset */
#define PIC32MZ_INT_OFF084_OFFSET    0x0690  /* Interrupt vector 84 address offset */
#define PIC32MZ_INT_OFF085_OFFSET    0x0694  /* Interrupt vector 85 address offset */
#define PIC32MZ_INT_OFF086_OFFSET    0x0698  /* Interrupt vector 86 address offset */
#define PIC32MZ_INT_OFF087_OFFSET    0x069c  /* Interrupt vector 87 address offset */
#define PIC32MZ_INT_OFF088_OFFSET    0x06a0  /* Interrupt vector 88 address offset */
#define PIC32MZ_INT_OFF089_OFFSET    0x06a4  /* Interrupt vector 89 address offset */
#define PIC32MZ_INT_OFF090_OFFSET    0x06a8  /* Interrupt vector 90 address offset */
#define PIC32MZ_INT_OFF091_OFFSET    0x06ac  /* Interrupt vector 91 address offset */
#define PIC32MZ_INT_OFF092_OFFSET    0x06b0  /* Interrupt vector 92 address offset */
#define PIC32MZ_INT_OFF093_OFFSET    0x06b4  /* Interrupt vector 93 address offset */
#define PIC32MZ_INT_OFF094_OFFSET    0x06b8  /* Interrupt vector 94 address offset */
#define PIC32MZ_INT_OFF095_OFFSET    0x06bc  /* Interrupt vector 95 address offset */

#define PIC32MZ_INT_OFF096_OFFSET    0x06c0  /* Interrupt vector 96 address offset */
#define PIC32MZ_INT_OFF097_OFFSET    0x06c4  /* Interrupt vector 97 address offset */
#define PIC32MZ_INT_OFF098_OFFSET    0x06c8  /* Interrupt vector 98 address offset */
#define PIC32MZ_INT_OFF099_OFFSET    0x06cc  /* Interrupt vector 99 address offset */
#define PIC32MZ_INT_OFF100_OFFSET    0x06d0  /* Interrupt vector 100 address offset */
#define PIC32MZ_INT_OFF101_OFFSET    0x06d4  /* Interrupt vector 101 address offset */
#define PIC32MZ_INT_OFF102_OFFSET    0x06d8  /* Interrupt vector 102 address offset */
#define PIC32MZ_INT_OFF103_OFFSET    0x06dc  /* Interrupt vector 103 address offset */
#define PIC32MZ_INT_OFF104_OFFSET    0x06e0  /* Interrupt vector 104 address offset */
#define PIC32MZ_INT_OFF105_OFFSET    0x06e4  /* Interrupt vector 105 address offset */
#define PIC32MZ_INT_OFF106_OFFSET    0x06e8  /* Interrupt vector 106 address offset */
#define PIC32MZ_INT_OFF107_OFFSET    0x06ec  /* Interrupt vector 107 address offset */
#define PIC32MZ_INT_OFF108_OFFSET    0x06f0  /* Interrupt vector 108 address offset */
#define PIC32MZ_INT_OFF109_OFFSET    0x06f4  /* Interrupt vector 109 address offset */
#define PIC32MZ_INT_OFF110_OFFSET    0x06f8  /* Interrupt vector 110 address offset */
#define PIC32MZ_INT_OFF111_OFFSET    0x06fc  /* Interrupt vector 111 address offset */

#define PIC32MZ_INT_OFF112_OFFSET    0x0700  /* Interrupt vector 112 address offset */
#define PIC32MZ_INT_OFF113_OFFSET    0x0704  /* Interrupt vector 113 address offset */
#define PIC32MZ_INT_OFF114_OFFSET    0x0708  /* Interrupt vector 114 address offset */
#define PIC32MZ_INT_OFF115_OFFSET    0x070c  /* Interrupt vector 115 address offset */
#define PIC32MZ_INT_OFF116_OFFSET    0x0710  /* Interrupt vector 116 address offset */
#define PIC32MZ_INT_OFF117_OFFSET    0x0714  /* Interrupt vector 117 address offset */
#define PIC32MZ_INT_OFF118_OFFSET    0x0718  /* Interrupt vector 118 address offset */
#define PIC32MZ_INT_OFF119_OFFSET    0x071c  /* Interrupt vector 119 address offset */
#define PIC32MZ_INT_OFF120_OFFSET    0x0720  /* Interrupt vector 120 address offset */
#define PIC32MZ_INT_OFF121_OFFSET    0x0724  /* Interrupt vector 121 address offset */
#define PIC32MZ_INT_OFF122_OFFSET    0x0728  /* Interrupt vector 122 address offset */
#define PIC32MZ_INT_OFF123_OFFSET    0x072c  /* Interrupt vector 123 address offset */
#define PIC32MZ_INT_OFF124_OFFSET    0x0730  /* Interrupt vector 124 address offset */
#define PIC32MZ_INT_OFF125_OFFSET    0x0734  /* Interrupt vector 125 address offset */
#define PIC32MZ_INT_OFF126_OFFSET    0x0738  /* Interrupt vector 126 address offset */
#define PIC32MZ_INT_OFF127_OFFSET    0x073c  /* Interrupt vector 127 address offset */

#define PIC32MZ_INT_OFF128_OFFSET    0x0740  /* Interrupt vector 128 address offset */
#define PIC32MZ_INT_OFF129_OFFSET    0x0744  /* Interrupt vector 129 address offset */
#define PIC32MZ_INT_OFF130_OFFSET    0x0748  /* Interrupt vector 130 address offset */
#define PIC32MZ_INT_OFF131_OFFSET    0x074c  /* Interrupt vector 131 address offset */
#define PIC32MZ_INT_OFF132_OFFSET    0x0750  /* Interrupt vector 132 address offset */
#define PIC32MZ_INT_OFF133_OFFSET    0x0754  /* Interrupt vector 133 address offset */
#define PIC32MZ_INT_OFF134_OFFSET    0x0758  /* Interrupt vector 134 address offset */
#define PIC32MZ_INT_OFF135_OFFSET    0x075c  /* Interrupt vector 135 address offset */
#define PIC32MZ_INT_OFF136_OFFSET    0x0760  /* Interrupt vector 136 address offset */
#define PIC32MZ_INT_OFF137_OFFSET    0x0764  /* Interrupt vector 137 address offset */
#define PIC32MZ_INT_OFF138_OFFSET    0x0768  /* Interrupt vector 138 address offset */
#define PIC32MZ_INT_OFF139_OFFSET    0x076c  /* Interrupt vector 139 address offset */
#define PIC32MZ_INT_OFF140_OFFSET    0x0770  /* Interrupt vector 140 address offset */
#define PIC32MZ_INT_OFF141_OFFSET    0x0774  /* Interrupt vector 141 address offset */
#define PIC32MZ_INT_OFF142_OFFSET    0x0778  /* Interrupt vector 142 address offset */
#define PIC32MZ_INT_OFF143_OFFSET    0x077c  /* Interrupt vector 143 address offset */

