apache/nuttx/arch/mips/src/pic32mz/hardware/pic32mz_int.h
#define PIC32MZ_INT_OFF144_OFFSET    0x0780  /* Interrupt vector 144 address offset */
#define PIC32MZ_INT_OFF145_OFFSET    0x0784  /* Interrupt vector 145 address offset */
#define PIC32MZ_INT_OFF146_OFFSET    0x0788  /* Interrupt vector 146 address offset */
#define PIC32MZ_INT_OFF147_OFFSET    0x078c  /* Interrupt vector 147 address offset */
#define PIC32MZ_INT_OFF148_OFFSET    0x0790  /* Interrupt vector 148 address offset */
#define PIC32MZ_INT_OFF149_OFFSET    0x0794  /* Interrupt vector 149 address offset */
#define PIC32MZ_INT_OFF150_OFFSET    0x0798  /* Interrupt vector 150 address offset */
#define PIC32MZ_INT_OFF151_OFFSET    0x079c  /* Interrupt vector 151 address offset */
#define PIC32MZ_INT_OFF152_OFFSET    0x07a0  /* Interrupt vector 152 address offset */
#define PIC32MZ_INT_OFF153_OFFSET    0x07a4  /* Interrupt vector 153 address offset */
#define PIC32MZ_INT_OFF154_OFFSET    0x07a8  /* Interrupt vector 154 address offset */
#define PIC32MZ_INT_OFF155_OFFSET    0x07ac  /* Interrupt vector 155 address offset */
#define PIC32MZ_INT_OFF156_OFFSET    0x07b0  /* Interrupt vector 156 address offset */
#define PIC32MZ_INT_OFF157_OFFSET    0x07b4  /* Interrupt vector 157 address offset */
#define PIC32MZ_INT_OFF158_OFFSET    0x07b8  /* Interrupt vector 158 address offset */
#define PIC32MZ_INT_OFF159_OFFSET    0x07bc  /* Interrupt vector 159 address offset */

#define PIC32MZ_INT_OFF160_OFFSET    0x07c0  /* Interrupt vector 160 address offset */
#define PIC32MZ_INT_OFF161_OFFSET    0x07c4  /* Interrupt vector 161 address offset */
#define PIC32MZ_INT_OFF162_OFFSET    0x07c8  /* Interrupt vector 162 address offset */
#define PIC32MZ_INT_OFF163_OFFSET    0x07cc  /* Interrupt vector 163 address offset */
#define PIC32MZ_INT_OFF164_OFFSET    0x07d0  /* Interrupt vector 164 address offset */
#define PIC32MZ_INT_OFF165_OFFSET    0x07d4  /* Interrupt vector 165 address offset */
#define PIC32MZ_INT_OFF166_OFFSET    0x07d8  /* Interrupt vector 166 address offset */
#define PIC32MZ_INT_OFF167_OFFSET    0x07dc  /* Interrupt vector 167 address offset */
#define PIC32MZ_INT_OFF168_OFFSET    0x07e0  /* Interrupt vector 168 address offset */
#define PIC32MZ_INT_OFF169_OFFSET    0x07e4  /* Interrupt vector 169 address offset */
#define PIC32MZ_INT_OFF170_OFFSET    0x07e8  /* Interrupt vector 170 address offset */
#define PIC32MZ_INT_OFF171_OFFSET    0x07ec  /* Interrupt vector 171 address offset */
#define PIC32MZ_INT_OFF172_OFFSET    0x07f0  /* Interrupt vector 172 address offset */
#define PIC32MZ_INT_OFF173_OFFSET    0x07f4  /* Interrupt vector 173 address offset */
#define PIC32MZ_INT_OFF174_OFFSET    0x07f8  /* Interrupt vector 174 address offset */
#define PIC32MZ_INT_OFF175_OFFSET    0x07fc  /* Interrupt vector 175 address offset */

#define PIC32MZ_INT_OFF176_OFFSET    0x0800  /* Interrupt vector 176 address offset */
#define PIC32MZ_INT_OFF177_OFFSET    0x0804  /* Interrupt vector 177 address offset */
#define PIC32MZ_INT_OFF178_OFFSET    0x0808  /* Interrupt vector 178 address offset */
#define PIC32MZ_INT_OFF179_OFFSET    0x080c  /* Interrupt vector 179 address offset */
#define PIC32MZ_INT_OFF180_OFFSET    0x0810  /* Interrupt vector 180 address offset */
#define PIC32MZ_INT_OFF181_OFFSET    0x0814  /* Interrupt vector 181 address offset */
#define PIC32MZ_INT_OFF182_OFFSET    0x0818  /* Interrupt vector 182 address offset */
#define PIC32MZ_INT_OFF183_OFFSET    0x081c  /* Interrupt vector 183 address offset */
#define PIC32MZ_INT_OFF184_OFFSET    0x0820  /* Interrupt vector 184 address offset */
#define PIC32MZ_INT_OFF185_OFFSET    0x0824  /* Interrupt vector 185 address offset */
#define PIC32MZ_INT_OFF186_OFFSET    0x0828  /* Interrupt vector 186 address offset */
#define PIC32MZ_INT_OFF187_OFFSET    0x082c  /* Interrupt vector 187 address offset */
#define PIC32MZ_INT_OFF188_OFFSET    0x0830  /* Interrupt vector 188 address offset */
#define PIC32MZ_INT_OFF189_OFFSET    0x0834  /* Interrupt vector 189 address offset */
#define PIC32MZ_INT_OFF190_OFFSET    0x0838  /* Interrupt vector 190 address offset */

/* Register Addresses *******************************************************/

#define PIC32MZ_INT_INTCON           (PIC32MZ_INT_K1BASE+PIC32MZ_INT_INTCON_OFFSET)
#define PIC32MZ_INT_INTCONCLR        (PIC32MZ_INT_K1BASE+PIC32MZ_INT_INTCONCLR_OFFSET)
#define PIC32MZ_INT_INTCONSET        (PIC32MZ_INT_K1BASE+PIC32MZ_INT_INTCONSET_OFFSET)
#define PIC32MZ_INT_INTCONINV        (PIC32MZ_INT_K1BASE+PIC32MZ_INT_INTCONINV_OFFSET)

#define PIC32MZ_INT_PRISS            (PIC32MZ_INT_K1BASE+PIC32MZ_INT_PRISS_OFFSET)
#define PIC32MZ_INT_PRISSCLR         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_PRISSCLR_OFFSET)
#define PIC32MZ_INT_PRISSSET         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_PRISSSET_OFFSET)
#define PIC32MZ_INT_PRISSINV         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_PRISSINV_OFFSET)

#define PIC32MZ_INT_INTSTAT          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_INTSTAT_OFFSET)
#define PIC32MZ_INT_INTSTATCLR       (PIC32MZ_INT_K1BASE+PIC32MZ_INT_INTSTATCLR_OFFSET)
#define PIC32MZ_INT_INTSTATSET       (PIC32MZ_INT_K1BASE+PIC32MZ_INT_INTSTATSET_OFFSET)
#define PIC32MZ_INT_INTSTATINV       (PIC32MZ_INT_K1BASE+PIC32MZ_INT_INTSTATINV_OFFSET)

#define PIC32MZ_INT_IPTMR            (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPTMR_OFFSET)
#define PIC32MZ_INT_IPTMRCLR         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPTMRCLR_OFFSET)
#define PIC32MZ_INT_IPTMRSET         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPTMRSET_OFFSET)
#define PIC32MZ_INT_IPTMRINV         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPTMRINV_OFFSET)

#define PIC32MZ_INT_IFS(n)           (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IFS_OFFSET(n))
#define PIC32MZ_INT_IFSCLR(n)        (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IFSCLR_OFFSET(n))
#define PIC32MZ_INT_IFSSET(n)        (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IFSSET_OFFSET(n))
#define PIC32MZ_INT_IFSINV(n)        (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IFSINV_OFFSET(n))

#define PIC32MZ_INT_IFS0             (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IFS0_OFFSET)
#define PIC32MZ_INT_IFS0CLR          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IFS0CLR_OFFSET)
#define PIC32MZ_INT_IFS0SET          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IFS0SET_OFFSET)
#define PIC32MZ_INT_IFS0INV          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IFS0INV_OFFSET)

#define PIC32MZ_INT_IFS1             (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IFS1_OFFSET)
#define PIC32MZ_INT_IFS1CLR          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IFS1CLR_OFFSET)
#define PIC32MZ_INT_IFS1SET          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IFS1SET_OFFSET)
#define PIC32MZ_INT_IFS1INV          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IFS1INV_OFFSET)

#define PIC32MZ_INT_IFS2             (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IFS2_OFFSET)
#define PIC32MZ_INT_IFS2CLR          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IFS2CLR_OFFSET)
#define PIC32MZ_INT_IFS2SET          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IFS2SET_OFFSET)
#define PIC32MZ_INT_IFS2INV          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IFS2INV_OFFSET)

#define PIC32MZ_INT_IFS3             (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IFS3_OFFSET)
#define PIC32MZ_INT_IFS3CLR          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IFS3CLR_OFFSET)
#define PIC32MZ_INT_IFS3SET          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IFS3SET_OFFSET)
#define PIC32MZ_INT_IFS3INV          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IFS3INV_OFFSET)

#define PIC32MZ_INT_IFS4             (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IFS4_OFFSET)
#define PIC32MZ_INT_IFS4CLR          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IFS4CLR_OFFSET)
#define PIC32MZ_INT_IFS4SET          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IFS4SET_OFFSET)
#define PIC32MZ_INT_IFS4INV          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IFS4INV_OFFSET)

#define PIC32MZ_INT_IFS5             (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IFS5_OFFSET)
#define PIC32MZ_INT_IFS5CLR          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IFS5CLR_OFFSET)
#define PIC32MZ_INT_IFS5SET          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IFS5SET_OFFSET)
#define PIC32MZ_INT_IFS5INV          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IFS5INV_OFFSET)

