apache/nuttx/arch/mips/src/pic32mz/hardware/pic32mz_int.h
#define PIC32MZ_INT_IEC(n)           (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IEC_OFFSET(n))
#define PIC32MZ_INT_IECCLR(n)        (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IECCLR_OFFSET(n))
#define PIC32MZ_INT_IECSET(n)        (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IECSET_OFFSET(n))
#define PIC32MZ_INT_IECINV(n)        (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IECINV_OFFSET(n))

#define PIC32MZ_INT_IEC0             (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IEC0_OFFSET)
#define PIC32MZ_INT_IEC0CLR          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IEC0CLR_OFFSET)
#define PIC32MZ_INT_IEC0SET          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IEC0SET_OFFSET)
#define PIC32MZ_INT_IEC0INV          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IEC0_OFFSET)

#define PIC32MZ_INT_IEC1             (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IEC1_OFFSET)
#define PIC32MZ_INT_IEC1CLR          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IEC1CLR_OFFSET)
#define PIC32MZ_INT_IEC1SET          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IEC1SET_OFFSET)
#define PIC32MZ_INT_IEC1INV          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IEC1INV_OFFSET)

#define PIC32MZ_INT_IEC2             (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IEC2_OFFSET)
#define PIC32MZ_INT_IEC2CLR          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IEC2CLR_OFFSET)
#define PIC32MZ_INT_IEC2SET          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IEC2SET_OFFSET)
#define PIC32MZ_INT_IEC2INV          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IEC2INV_OFFSET)

#define PIC32MZ_INT_IEC3             (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IEC3_OFFSET)
#define PIC32MZ_INT_IEC3CLR          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IEC3CLR_OFFSET)
#define PIC32MZ_INT_IEC3SET          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IEC3SET_OFFSET)
#define PIC32MZ_INT_IEC3INV          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IEC3INV_OFFSET)

#define PIC32MZ_INT_IEC4             (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IEC4_OFFSET)
#define PIC32MZ_INT_IEC4CLR          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IEC4CLR_OFFSET)
#define PIC32MZ_INT_IEC4SET          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IEC4SET_OFFSET)
#define PIC32MZ_INT_IEC4INV          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IEC4INV_OFFSET)

#define PIC32MZ_INT_IEC5             (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IEC5_OFFSET)
#define PIC32MZ_INT_IEC5CLR          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IEC5CLR_OFFSET)
#define PIC32MZ_INT_IEC5SET          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IEC5SET_OFFSET)
#define PIC32MZ_INT_IEC5INV          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IEC5INV_OFFSET)

#define PIC32MZ_INT_IPC(n)           (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC_OFFSET(n))
#define PIC32MZ_INT_IPCCLR(n)        (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPCCLR_OFFSET(n))
#define PIC32MZ_INT_IPCSET(n)        (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPCSET_OFFSET(n))
#define PIC32MZ_INT_IPCINV(n)        (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPCINV_OFFSET(n))

#define PIC32MZ_INT_IPC0             (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC0_OFFSET)
#define PIC32MZ_INT_IPC0CLR          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC0CLR_OFFSET)
#define PIC32MZ_INT_IPC0SET          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC0SET_OFFSET)
#define PIC32MZ_INT_IPC0INV          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC0INV_OFFSET)

#define PIC32MZ_INT_IPC1             (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC1_OFFSET)
#define PIC32MZ_INT_IPC1CLR          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC1CLR_OFFSET)
#define PIC32MZ_INT_IPC1SET          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC1SET_OFFSET)
#define PIC32MZ_INT_IPC1INV          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC1INV_OFFSET)

#define PIC32MZ_INT_IPC2             (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC2_OFFSET)
#define PIC32MZ_INT_IPC2CLR          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC2CLR_OFFSET)
#define PIC32MZ_INT_IPC2SET          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC2SET_OFFSET)
#define PIC32MZ_INT_IPC2INV          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC2INV_OFFSET)

#define PIC32MZ_INT_IPC3             (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC3_OFFSET)
#define PIC32MZ_INT_IPC3CLR          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC3CLR_OFFSET)
#define PIC32MZ_INT_IPC3SET          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC3SET_OFFSET)
#define PIC32MZ_INT_IPC3INV          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC3INV_OFFSET)

#define PIC32MZ_INT_IPC4             (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC4_OFFSET)
#define PIC32MZ_INT_IPC4CLR          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC4CLR_OFFSET)
#define PIC32MZ_INT_IPC4SET          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC4SET_OFFSET)
#define PIC32MZ_INT_IPC4INV          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC4INV_OFFSET)

#define PIC32MZ_INT_IPC5             (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC5_OFFSET)
#define PIC32MZ_INT_IPC5CLR          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC5CLR_OFFSET)
#define PIC32MZ_INT_IPC5SET          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC5SET_OFFSET)
#define PIC32MZ_INT_IPC5INV          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC5INV_OFFSET)

#define PIC32MZ_INT_IPC6             (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC6_OFFSET)
#define PIC32MZ_INT_IPC6CLR          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC6CLR_OFFSET)
#define PIC32MZ_INT_IPC6SET          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC6SET_OFFSET)
#define PIC32MZ_INT_IPC6INV          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC6INV_OFFSET)

#define PIC32MZ_INT_IPC7             (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC7_OFFSET)
#define PIC32MZ_INT_IPC7CLR          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC7CLR_OFFSET)
#define PIC32MZ_INT_IPC7SET          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC7SET_OFFSET)
#define PIC32MZ_INT_IPC7INV          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC7INV_OFFSET)

#define PIC32MZ_INT_IPC8             (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC8_OFFSET)
#define PIC32MZ_INT_IPC8CLR          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC8CLR_OFFSET)
#define PIC32MZ_INT_IPC8SET          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC8SET_OFFSET)
#define PIC32MZ_INT_IPC8INV          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC8INV_OFFSET)

#define PIC32MZ_INT_IPC9             (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC9_OFFSET)
#define PIC32MZ_INT_IPC9CLR          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC9CLR_OFFSET)
#define PIC32MZ_INT_IPC9SET          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC9SET_OFFSET)
#define PIC32MZ_INT_IPC9INV          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC9INV_OFFSET)

