apache/nuttx/arch/mips/src/pic32mz/hardware/pic32mz_int.h
#define PIC32MZ_INT_IPC10            (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC10_OFFSET)
#define PIC32MZ_INT_IPC10CLR         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC10CLR_OFFSET)
#define PIC32MZ_INT_IPC10SET         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC10SET_OFFSET)
#define PIC32MZ_INT_IPC10INV         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC10INV_OFFSET)

#define PIC32MZ_INT_IPC11            (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC11_OFFSET)
#define PIC32MZ_INT_IPC11CLR         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC11CLR_OFFSET)
#define PIC32MZ_INT_IPC11SET         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC11SET_OFFSET)
#define PIC32MZ_INT_IPC11INV         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC11INV_OFFSET)

#define PIC32MZ_INT_IPC12            (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC12_OFFSET)
#define PIC32MZ_INT_IPC12CLR         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC12CLR_OFFSET)
#define PIC32MZ_INT_IPC12SET         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC12SET_OFFSET)
#define PIC32MZ_INT_IPC12INV         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC12INV_OFFSET)

#define PIC32MZ_INT_IPC13            (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC13_OFFSET)
#define PIC32MZ_INT_IPC13CLR         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC13CLR_OFFSET)
#define PIC32MZ_INT_IPC13SET         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC13SET_OFFSET)
#define PIC32MZ_INT_IPC13INV         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC13INV_OFFSET)

#define PIC32MZ_INT_IPC14            (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC14_OFFSET)
#define PIC32MZ_INT_IPC14CLR         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC14CLR_OFFSET)
#define PIC32MZ_INT_IPC14SET         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC14SET_OFFSET)
#define PIC32MZ_INT_IPC14INV         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC14INV_OFFSET)

#define PIC32MZ_INT_IPC15            (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC15_OFFSET)
#define PIC32MZ_INT_IPC15CLR         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC15CLR_OFFSET)
#define PIC32MZ_INT_IPC15SET         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC15SET_OFFSET)
#define PIC32MZ_INT_IPC15INV         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC15INV_OFFSET)

#define PIC32MZ_INT_IPC16            (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC16_OFFSET)
#define PIC32MZ_INT_IPC16CLR         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC16CLR_OFFSET)
#define PIC32MZ_INT_IPC16SET         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC16SET_OFFSET)
#define PIC32MZ_INT_IPC16INV         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC16INV_OFFSET)

#define PIC32MZ_INT_IPC17            (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC17_OFFSET)
#define PIC32MZ_INT_IPC17CLR         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC17CLR_OFFSET)
#define PIC32MZ_INT_IPC17SET         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC17SET_OFFSET)
#define PIC32MZ_INT_IPC17INV         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC17INV_OFFSET)

#define PIC32MZ_INT_IPC18            (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC18_OFFSET)
#define PIC32MZ_INT_IPC18CLR         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC18CLR_OFFSET)
#define PIC32MZ_INT_IPC18SET         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC18SET_OFFSET)
#define PIC32MZ_INT_IPC18INV         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC18INV_OFFSET)

#define PIC32MZ_INT_IPC19            (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC19_OFFSET)
#define PIC32MZ_INT_IPC19CLR         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC19CLR_OFFSET)
#define PIC32MZ_INT_IPC19SET         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC19SET_OFFSET)
#define PIC32MZ_INT_IPC19INV         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC19INV_OFFSET)

#define PIC32MZ_INT_IPC20            (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC20_OFFSET)
#define PIC32MZ_INT_IPC20CLR         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC20CLR_OFFSET)
#define PIC32MZ_INT_IPC20SET         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC20SET_OFFSET)
#define PIC32MZ_INT_IPC20INV         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC20INV_OFFSET)

#define PIC32MZ_INT_IPC21            (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC21_OFFSET)
#define PIC32MZ_INT_IPC21CLR         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC21CLR_OFFSET)
#define PIC32MZ_INT_IPC21SET         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC21SET_OFFSET)
#define PIC32MZ_INT_IPC21INV         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC21INV_OFFSET)

#define PIC32MZ_INT_IPC22            (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC22_OFFSET)
#define PIC32MZ_INT_IPC22CLR         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC22CLR_OFFSET)
#define PIC32MZ_INT_IPC22SET         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC22SET_OFFSET)
#define PIC32MZ_INT_IPC22INV         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC22INV_OFFSET)

#define PIC32MZ_INT_IPC23            (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC23_OFFSET)
#define PIC32MZ_INT_IPC23CLR         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC23CLR_OFFSET)
#define PIC32MZ_INT_IPC23SET         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC23SET_OFFSET)
#define PIC32MZ_INT_IPC23INV         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC23INV_OFFSET)

#define PIC32MZ_INT_IPC24            (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC24_OFFSET)
#define PIC32MZ_INT_IPC24CLR         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC24CLR_OFFSET)
#define PIC32MZ_INT_IPC24SET         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC24SET_OFFSET)
#define PIC32MZ_INT_IPC24INV         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC24INV_OFFSET)

#define PIC32MZ_INT_IPC25            (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC25_OFFSET)
#define PIC32MZ_INT_IPC25CLR         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC25CLR_OFFSET)
#define PIC32MZ_INT_IPC25SET         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC25SET_OFFSET)
#define PIC32MZ_INT_IPC25INV         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC25INV_OFFSET)

#define PIC32MZ_INT_IPC26            (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC26_OFFSET)
#define PIC32MZ_INT_IPC26CLR         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC26CLR_OFFSET)
#define PIC32MZ_INT_IPC26SET         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC26SET_OFFSET)
#define PIC32MZ_INT_IPC26INV         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC26INV_OFFSET)

#define PIC32MZ_INT_IPC27            (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC27_OFFSET)
#define PIC32MZ_INT_IPC27CLR         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC27CLR_OFFSET)
#define PIC32MZ_INT_IPC27SET         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC27SET_OFFSET)
#define PIC32MZ_INT_IPC27INV         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC27INV_OFFSET)

#define PIC32MZ_INT_IPC28            (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC28_OFFSET)
#define PIC32MZ_INT_IPC28CLR         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC28CLR_OFFSET)
#define PIC32MZ_INT_IPC28SET         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC28SET_OFFSET)
#define PIC32MZ_INT_IPC28INV         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC28INV_OFFSET)

#define PIC32MZ_INT_IPC29            (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC29_OFFSET)
#define PIC32MZ_INT_IPC29CLR         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC29CLR_OFFSET)
#define PIC32MZ_INT_IPC29SET         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC29SET_OFFSET)
#define PIC32MZ_INT_IPC29INV         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC29INV_OFFSET)

#define PIC32MZ_INT_IPC30            (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC30_OFFSET)
#define PIC32MZ_INT_IPC30CLR         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC30CLR_OFFSET)
#define PIC32MZ_INT_IPC30SET         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC30SET_OFFSET)
#define PIC32MZ_INT_IPC30INV         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC30INV_OFFSET)

#define PIC32MZ_INT_IPC31            (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC31_OFFSET)
#define PIC32MZ_INT_IPC31CLR         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC31CLR_OFFSET)
#define PIC32MZ_INT_IPC31SET         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC31SET_OFFSET)
#define PIC32MZ_INT_IPC31INV         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC31INV_OFFSET)

#define PIC32MZ_INT_IPC32            (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC32_OFFSET)
#define PIC32MZ_INT_IPC32CLR         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC32CLR_OFFSET)
#define PIC32MZ_INT_IPC32SET         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC32SET_OFFSET)
#define PIC32MZ_INT_IPC32INV         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC32INV_OFFSET)

#define PIC32MZ_INT_IPC33            (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC33_OFFSET)
#define PIC32MZ_INT_IPC33CLR         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC33CLR_OFFSET)
#define PIC32MZ_INT_IPC33SET         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC33SET_OFFSET)
#define PIC32MZ_INT_IPC33INV         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC33INV_OFFSET)

#define PIC32MZ_INT_IPC34            (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC34_OFFSET)
#define PIC32MZ_INT_IPC34CLR         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC34CLR_OFFSET)
#define PIC32MZ_INT_IPC34SET         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC34SET_OFFSET)
#define PIC32MZ_INT_IPC34INV         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC34INV_OFFSET)

#define PIC32MZ_INT_IPC35            (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC35_OFFSET)
#define PIC32MZ_INT_IPC35CLR         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC35CLR_OFFSET)
#define PIC32MZ_INT_IPC35SET         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC35SET_OFFSET)
#define PIC32MZ_INT_IPC35INV         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC35INV_OFFSET)

#define PIC32MZ_INT_IPC36            (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC36_OFFSET)
#define PIC32MZ_INT_IPC36CLR         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC36CLR_OFFSET)
#define PIC32MZ_INT_IPC36SET         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC36SET_OFFSET)
#define PIC32MZ_INT_IPC36INV         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC36INV_OFFSET)

#define PIC32MZ_INT_IPC37            (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC37_OFFSET)
#define PIC32MZ_INT_IPC37CLR         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC37CLR_OFFSET)
#define PIC32MZ_INT_IPC37SET         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC37SET_OFFSET)
#define PIC32MZ_INT_IPC37INV         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC37INV_OFFSET)

