apache/nuttx/arch/mips/src/pic32mz/hardware/pic32mz_int.h
#define PIC32MZ_INT_IPC38            (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC38_OFFSET)
#define PIC32MZ_INT_IPC38CLR         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC38CLR_OFFSET)
#define PIC32MZ_INT_IPC38SET         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC38SET_OFFSET)
#define PIC32MZ_INT_IPC38INV         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC38INV_OFFSET)

#define PIC32MZ_INT_IPC39            (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC39_OFFSET)
#define PIC32MZ_INT_IPC39CLR         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC39CLR_OFFSET)
#define PIC32MZ_INT_IPC39SET         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC39SET_OFFSET)
#define PIC32MZ_INT_IPC39INV         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC39INV_OFFSET)

#define PIC32MZ_INT_IPC40            (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC40_OFFSET)
#define PIC32MZ_INT_IPC40CLR         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC40CLR_OFFSET)
#define PIC32MZ_INT_IPC40SET         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC40SET_OFFSET)
#define PIC32MZ_INT_IPC40INV         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC40INV_OFFSET)

#define PIC32MZ_INT_IPC41            (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC41_OFFSET)
#define PIC32MZ_INT_IPC41CLR         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC41CLR_OFFSET)
#define PIC32MZ_INT_IPC41SET         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC41SET_OFFSET)
#define PIC32MZ_INT_IPC41INV         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC41INV_OFFSET)

#define PIC32MZ_INT_IPC42            (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC42_OFFSET)
#define PIC32MZ_INT_IPC42CLR         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC42CLR_OFFSET)
#define PIC32MZ_INT_IPC42SET         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC42SET_OFFSET)
#define PIC32MZ_INT_IPC42INV         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC42INV_OFFSET)

#define PIC32MZ_INT_IPC43            (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC43_OFFSET)
#define PIC32MZ_INT_IPC43CLR         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC43CLR_OFFSET)
#define PIC32MZ_INT_IPC43SET         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC43SET_OFFSET)
#define PIC32MZ_INT_IPC43INV         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC43INV_OFFSET)

#define PIC32MZ_INT_IPC44            (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC44_OFFSET)
#define PIC32MZ_INT_IPC44CLR         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC44CLR_OFFSET)
#define PIC32MZ_INT_IPC44SET         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC44SET_OFFSET)
#define PIC32MZ_INT_IPC44INV         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC44INV_OFFSET)

#define PIC32MZ_INT_IPC45            (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC45_OFFSET)
#define PIC32MZ_INT_IPC45CLR         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC45CLR_OFFSET)
#define PIC32MZ_INT_IPC45SET         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC45SET_OFFSET)
#define PIC32MZ_INT_IPC45INV         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC45INV_OFFSET)

#define PIC32MZ_INT_IPC46            (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC46_OFFSET)
#define PIC32MZ_INT_IPC46CLR         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC46CLR_OFFSET)
#define PIC32MZ_INT_IPC46SET         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC46SET_OFFSET)
#define PIC32MZ_INT_IPC46INV         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC46INV_OFFSET)

#define PIC32MZ_INT_IPC47            (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC47_OFFSET)
#define PIC32MZ_INT_IPC47CLR         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC47CLR_OFFSET)
#define PIC32MZ_INT_IPC47SET         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC47SET_OFFSET)
#define PIC32MZ_INT_IPC47INV         (PIC32MZ_INT_K1BASE+PIC32MZ_INT_IPC47INV_OFFSET)

#define PIC32MZ_INT_OFF(n)          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF_OFFSET(n)
#define PIC32MZ_INT_OFF000          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF000_OFFSET)
#define PIC32MZ_INT_OFF001          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF001_OFFSET)
#define PIC32MZ_INT_OFF002          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF002_OFFSET)
#define PIC32MZ_INT_OFF003          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF003_OFFSET)
#define PIC32MZ_INT_OFF004          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF004_OFFSET)
#define PIC32MZ_INT_OFF005          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF005_OFFSET)
#define PIC32MZ_INT_OFF006          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF006_OFFSET)
#define PIC32MZ_INT_OFF007          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF007_OFFSET)
#define PIC32MZ_INT_OFF008          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF008_OFFSET)
#define PIC32MZ_INT_OFF009          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF009_OFFSET)
#define PIC32MZ_INT_OFF010          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF010_OFFSET)
#define PIC32MZ_INT_OFF011          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF011_OFFSET)
#define PIC32MZ_INT_OFF012          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF012_OFFSET)
#define PIC32MZ_INT_OFF013          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF013_OFFSET)
#define PIC32MZ_INT_OFF014          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF014_OFFSET)
#define PIC32MZ_INT_OFF015          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF015_OFFSET)

#define PIC32MZ_INT_OFF016          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF016_OFFSET)
#define PIC32MZ_INT_OFF017          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF017_OFFSET)
#define PIC32MZ_INT_OFF018          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF018_OFFSET)
#define PIC32MZ_INT_OFF019          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF019_OFFSET)
#define PIC32MZ_INT_OFF020          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF020_OFFSET)
#define PIC32MZ_INT_OFF021          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF021_OFFSET)
#define PIC32MZ_INT_OFF022          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF022_OFFSET)
#define PIC32MZ_INT_OFF023          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF023_OFFSET)
#define PIC32MZ_INT_OFF024          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF024_OFFSET)
#define PIC32MZ_INT_OFF025          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF025_OFFSET)
#define PIC32MZ_INT_OFF026          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF026_OFFSET)
#define PIC32MZ_INT_OFF027          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF027_OFFSET)
#define PIC32MZ_INT_OFF028          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF028_OFFSET)
#define PIC32MZ_INT_OFF029          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF029_OFFSET)
#define PIC32MZ_INT_OFF030          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF030_OFFSET)
#define PIC32MZ_INT_OFF031          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF031_OFFSET)

