apache/nuttx/arch/mips/src/pic32mz/hardware/pic32mz_int.h
#define PIC32MZ_INT_OFF032          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF032_OFFSET)
#define PIC32MZ_INT_OFF033          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF033_OFFSET)
#define PIC32MZ_INT_OFF034          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF034_OFFSET)
#define PIC32MZ_INT_OFF035          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF035_OFFSET)
#define PIC32MZ_INT_OFF036          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF036_OFFSET)
#define PIC32MZ_INT_OFF037          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF037_OFFSET)
#define PIC32MZ_INT_OFF038          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF038_OFFSET)
#define PIC32MZ_INT_OFF039          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF039_OFFSET)
#define PIC32MZ_INT_OFF040          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF040_OFFSET)
#define PIC32MZ_INT_OFF041          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF041_OFFSET)
#define PIC32MZ_INT_OFF042          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF042_OFFSET)
#define PIC32MZ_INT_OFF043          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF043_OFFSET)
#define PIC32MZ_INT_OFF044          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF044_OFFSET)
#define PIC32MZ_INT_OFF045          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF045_OFFSET)
#define PIC32MZ_INT_OFF046          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF046_OFFSET)
#define PIC32MZ_INT_OFF047          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF047_OFFSET)

#define PIC32MZ_INT_OFF048          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF048_OFFSET)
#define PIC32MZ_INT_OFF049          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF049_OFFSET)
#define PIC32MZ_INT_OFF050          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF050_OFFSET)
#define PIC32MZ_INT_OFF051          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF051_OFFSET)
#define PIC32MZ_INT_OFF052          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF052_OFFSET)
#define PIC32MZ_INT_OFF053          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF053_OFFSET)
#define PIC32MZ_INT_OFF054          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF054_OFFSET)
#define PIC32MZ_INT_OFF055          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF055_OFFSET)
#define PIC32MZ_INT_OFF056          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF056_OFFSET)
#define PIC32MZ_INT_OFF057          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF057_OFFSET)
#define PIC32MZ_INT_OFF058          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF058_OFFSET)
#define PIC32MZ_INT_OFF059          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF059_OFFSET)
#define PIC32MZ_INT_OFF060          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF060_OFFSET)
#define PIC32MZ_INT_OFF061          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF061_OFFSET)
#define PIC32MZ_INT_OFF062          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF062_OFFSET)
#define PIC32MZ_INT_OFF063          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF063_OFFSET)

#define PIC32MZ_INT_OFF064          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF064_OFFSET)
#define PIC32MZ_INT_OFF065          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF065_OFFSET)
#define PIC32MZ_INT_OFF066          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF066_OFFSET)
#define PIC32MZ_INT_OFF067          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF067_OFFSET)
#define PIC32MZ_INT_OFF068          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF068_OFFSET)
#define PIC32MZ_INT_OFF069          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF069_OFFSET)
#define PIC32MZ_INT_OFF070          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF070_OFFSET)
#define PIC32MZ_INT_OFF071          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF071_OFFSET)
#define PIC32MZ_INT_OFF072          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF072_OFFSET)
#define PIC32MZ_INT_OFF073          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF073_OFFSET)
#define PIC32MZ_INT_OFF074          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF074_OFFSET)
#define PIC32MZ_INT_OFF075          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF075_OFFSET)
#define PIC32MZ_INT_OFF076          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF076_OFFSET)
#define PIC32MZ_INT_OFF077          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF077_OFFSET)
#define PIC32MZ_INT_OFF078          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF078_OFFSET)
#define PIC32MZ_INT_OFF079          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF079_OFFSET)

#define PIC32MZ_INT_OFF080          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF080_OFFSET)
#define PIC32MZ_INT_OFF081          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF081_OFFSET)
#define PIC32MZ_INT_OFF082          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF082_OFFSET)
#define PIC32MZ_INT_OFF083          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF083_OFFSET)
#define PIC32MZ_INT_OFF084          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF084_OFFSET)
#define PIC32MZ_INT_OFF085          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF085_OFFSET)
#define PIC32MZ_INT_OFF086          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF086_OFFSET)
#define PIC32MZ_INT_OFF087          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF087_OFFSET)
#define PIC32MZ_INT_OFF088          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF088_OFFSET)
#define PIC32MZ_INT_OFF089          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF089_OFFSET)
#define PIC32MZ_INT_OFF090          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF090_OFFSET)
#define PIC32MZ_INT_OFF091          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF091_OFFSET)
#define PIC32MZ_INT_OFF092          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF092_OFFSET)
#define PIC32MZ_INT_OFF093          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF093_OFFSET)
#define PIC32MZ_INT_OFF094          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF094_OFFSET)
#define PIC32MZ_INT_OFF095          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF095_OFFSET)

#define PIC32MZ_INT_OFF096          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF096_OFFSET)
#define PIC32MZ_INT_OFF097          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF097_OFFSET)
#define PIC32MZ_INT_OFF098          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF098_OFFSET)
#define PIC32MZ_INT_OFF099          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF099_OFFSET)
#define PIC32MZ_INT_OFF100          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF100_OFFSET)
#define PIC32MZ_INT_OFF101          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF101_OFFSET)
#define PIC32MZ_INT_OFF102          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF102_OFFSET)
#define PIC32MZ_INT_OFF103          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF103_OFFSET)
#define PIC32MZ_INT_OFF104          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF104_OFFSET)
#define PIC32MZ_INT_OFF105          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF105_OFFSET)
#define PIC32MZ_INT_OFF106          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF106_OFFSET)
#define PIC32MZ_INT_OFF107          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF107_OFFSET)
#define PIC32MZ_INT_OFF108          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF108_OFFSET)
#define PIC32MZ_INT_OFF109          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF109_OFFSET)
#define PIC32MZ_INT_OFF110          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF110_OFFSET)
#define PIC32MZ_INT_OFF111          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF111_OFFSET)

#define PIC32MZ_INT_OFF112          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF112_OFFSET)
#define PIC32MZ_INT_OFF113          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF113_OFFSET)
#define PIC32MZ_INT_OFF114          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF114_OFFSET)
#define PIC32MZ_INT_OFF115          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF115_OFFSET)
#define PIC32MZ_INT_OFF116          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF116_OFFSET)
#define PIC32MZ_INT_OFF117          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF117_OFFSET)
#define PIC32MZ_INT_OFF118          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF118_OFFSET)
#define PIC32MZ_INT_OFF119          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF119_OFFSET)
#define PIC32MZ_INT_OFF120          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF120_OFFSET)
#define PIC32MZ_INT_OFF121          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF121_OFFSET)
#define PIC32MZ_INT_OFF122          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF122_OFFSET)
#define PIC32MZ_INT_OFF123          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF123_OFFSET)
#define PIC32MZ_INT_OFF124          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF124_OFFSET)
#define PIC32MZ_INT_OFF125          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF125_OFFSET)
#define PIC32MZ_INT_OFF126          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF126_OFFSET)
#define PIC32MZ_INT_OFF127          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF127_OFFSET)

#define PIC32MZ_INT_OFF128          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF128_OFFSET)
#define PIC32MZ_INT_OFF129          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF129_OFFSET)
#define PIC32MZ_INT_OFF130          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF130_OFFSET)
#define PIC32MZ_INT_OFF131          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF131_OFFSET)
#define PIC32MZ_INT_OFF132          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF132_OFFSET)
#define PIC32MZ_INT_OFF133          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF133_OFFSET)
#define PIC32MZ_INT_OFF134          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF134_OFFSET)
#define PIC32MZ_INT_OFF135          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF135_OFFSET)
#define PIC32MZ_INT_OFF136          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF136_OFFSET)
#define PIC32MZ_INT_OFF137          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF137_OFFSET)
#define PIC32MZ_INT_OFF138          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF138_OFFSET)
#define PIC32MZ_INT_OFF139          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF139_OFFSET)
#define PIC32MZ_INT_OFF140          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF140_OFFSET)
#define PIC32MZ_INT_OFF141          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF141_OFFSET)
#define PIC32MZ_INT_OFF142          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF142_OFFSET)
#define PIC32MZ_INT_OFF143          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF143_OFFSET)

#define PIC32MZ_INT_OFF144          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF144_OFFSET)
#define PIC32MZ_INT_OFF145          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF145_OFFSET)
#define PIC32MZ_INT_OFF146          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF146_OFFSET)
#define PIC32MZ_INT_OFF147          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF147_OFFSET)
#define PIC32MZ_INT_OFF148          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF148_OFFSET)
#define PIC32MZ_INT_OFF149          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF149_OFFSET)
#define PIC32MZ_INT_OFF150          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF150_OFFSET)
#define PIC32MZ_INT_OFF151          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF151_OFFSET)
#define PIC32MZ_INT_OFF152          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF152_OFFSET)
#define PIC32MZ_INT_OFF153          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF153_OFFSET)
#define PIC32MZ_INT_OFF154          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF154_OFFSET)
#define PIC32MZ_INT_OFF155          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF155_OFFSET)
#define PIC32MZ_INT_OFF156          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF156_OFFSET)
#define PIC32MZ_INT_OFF157          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF157_OFFSET)
#define PIC32MZ_INT_OFF158          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF158_OFFSET)
#define PIC32MZ_INT_OFF159          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF159_OFFSET)

#define PIC32MZ_INT_OFF160          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF160_OFFSET)
#define PIC32MZ_INT_OFF161          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF161_OFFSET)
#define PIC32MZ_INT_OFF162          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF162_OFFSET)
#define PIC32MZ_INT_OFF163          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF163_OFFSET)
#define PIC32MZ_INT_OFF164          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF164_OFFSET)
#define PIC32MZ_INT_OFF165          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF165_OFFSET)
#define PIC32MZ_INT_OFF166          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF166_OFFSET)
#define PIC32MZ_INT_OFF167          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF167_OFFSET)
#define PIC32MZ_INT_OFF168          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF168_OFFSET)
#define PIC32MZ_INT_OFF169          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF169_OFFSET)
#define PIC32MZ_INT_OFF170          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF170_OFFSET)
#define PIC32MZ_INT_OFF171          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF171_OFFSET)
#define PIC32MZ_INT_OFF172          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF172_OFFSET)
#define PIC32MZ_INT_OFF173          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF173_OFFSET)
#define PIC32MZ_INT_OFF174          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF174_OFFSET)
#define PIC32MZ_INT_OFF175          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF175_OFFSET)

#define PIC32MZ_INT_OFF176          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF176_OFFSET)
#define PIC32MZ_INT_OFF177          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF177_OFFSET)
#define PIC32MZ_INT_OFF178          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF178_OFFSET)
#define PIC32MZ_INT_OFF179          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF179_OFFSET)
#define PIC32MZ_INT_OFF180          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF180_OFFSET)
#define PIC32MZ_INT_OFF181          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF181_OFFSET)
#define PIC32MZ_INT_OFF182          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF182_OFFSET)
#define PIC32MZ_INT_OFF183          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF183_OFFSET)
#define PIC32MZ_INT_OFF184          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF184_OFFSET)
#define PIC32MZ_INT_OFF185          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF185_OFFSET)
#define PIC32MZ_INT_OFF186          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF186_OFFSET)
#define PIC32MZ_INT_OFF187          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF187_OFFSET)
#define PIC32MZ_INT_OFF188          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF188_OFFSET)
#define PIC32MZ_INT_OFF189          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF189_OFFSET)
#define PIC32MZ_INT_OFF190          (PIC32MZ_INT_K1BASE+PIC32MZ_INT_OFF190_OFFSET)

/* Register Bit-Field Definitions *******************************************/

/* Interrupt control register */

#define INT_INTCON_INT0EP            (1 << 0)  /* Bit 0:  External interrupt 0 edge polarity control */
#define INT_INTCON_INT1EP            (1 << 1)  /* Bit 1:  External interrupt 1 edge polarity control */
#define INT_INTCON_INT2EP            (1 << 2)  /* Bit 2:  External interrupt 2 edge polarity control */
#define INT_INTCON_INT3EP            (1 << 3)  /* Bit 3:  External interrupt 3 edge polarity control */
#define INT_INTCON_INT4EP            (1 << 4)  /* Bit 4:  External interrupt 4 edge polarity control */
#define INT_INTCON_TPC_SHIFT         (8)       /* Bits 8-10: Interrupt proximity timer control */
#define INT_INTCON_TPC_MASK          (7 << INT_INTCON_TPC_SHIFT)
#  define INT_INTCON_TPC_DIS         (0 << INT_INTCON_TPC_SHIFT) /* Disables proximity timer */
#  define INT_INTCON_TPC_PRIO1       (1 << INT_INTCON_TPC_SHIFT) /* Int group priority 1 start IP timer */
#  define INT_INTCON_TPC_PRIO2       (2 << INT_INTCON_TPC_SHIFT) /* Int group priority <=2 start TP timer */
#  define INT_INTCON_TPC_PRIO3       (3 << INT_INTCON_TPC_SHIFT) /* Int group priority <=3 start TP timer */
#  define INT_INTCON_TPC_PRIO4       (4 << INT_INTCON_TPC_SHIFT) /* Int group priority <=4 start TP timer */
#  define INT_INTCON_TPC_PRIO5       (5 << INT_INTCON_TPC_SHIFT) /* Int group priority <=5 start TP timer */
#  define INT_INTCON_TPC_PRIO6       (6 << INT_INTCON_TPC_SHIFT) /* Int group priority <=6 start TP timer */
#  define INT_INTCON_TPC_PRIO7       (7 << INT_INTCON_TPC_SHIFT) /* Int group priority <=7 start TP timer */
#define INT_INTCON_MVEC              (1 << 12) /* Bit 12: Multi vector configuration */

/* Priority shadow select register */

