apache/nuttx/arch/mips/src/pic32mz/hardware/pic32mz_int.h
#define INT_PRISS_SS0                (1 << 0)  /* Bit 0: Single Vector Shadow Register Set bit */
#define INT_PRISS_PRI1SS_SHIFT       (4)       /* Bits 4-7: Interrupt with Priority Level 1 Shadow Set bits */
#define INT_PRISS_PRI1SS_MASK        (15 << INT_PRISS_PRI1SS_SHIFT)
#  define INT_PRISS_PRI1SS(n)        ((uint32_t)(n) << INT_PRISS_PRI1SS_SHIFT)
#define INT_PRISS_PRI2SS_SHIFT       (8)       /* Bits 8-11: Interrupt with Priority Level 2 Shadow Set bits */
#define INT_PRISS_PRI2SS_MASK        (15 << INT_PRISS_PRI2SS_SHIFT)
#  define INT_PRISS_PRI2SS(n)        ((uint32_t)(n) << INT_PRISS_PRI2SS_SHIFT)
#define INT_PRISS_PRI3SS_SHIFT       (12)      /* Bits 12-15: Interrupt with Priority Level 3 Shadow Set bits */
#define INT_PRISS_PRI3SS_MASK        (15 << INT_PRISS_PRI3SS_SHIFT)
#  define INT_PRISS_PRI3SS(n)        ((uint32_t)(n) << INT_PRISS_PRI3SS_SHIFT)
#define INT_PRISS_PRI4SS_SHIFT       (16)      /* Bits 16-19: Interrupt with Priority Level 4 Shadow Set bits */
#define INT_PRISS_PRI4SS_MASK        (15 << INT_PRISS_PRI4SS_SHIFT)
#  define INT_PRISS_PRI4SS(n)        ((uint32_t)(n) << INT_PRISS_PRI4SS_SHIFT)
#define INT_PRISS_PRI5SS_SHIFT       (20)      /* Bits 20-23: Interrupt with Priority Level 5 Shadow Set bits */
#define INT_PRISS_PRI5SS_MASK        (15 << INT_PRISS_PRI5SS_SHIFT)
#  define INT_PRISS_PRI5SS(n)        ((uint32_t)(n) << INT_PRISS_PRI5SS_SHIFT)
#define INT_PRISS_PRI6SS_SHIFT       (24)      /* Bits 24-27: Interrupt with Priority Level 6 Shadow Set bits */
#define INT_PRISS_PRI6SS_MASK        (15 << INT_PRISS_PRI6SS_SHIFT)
#  define INT_PRISS_PRI6SS(n)        ((uint32_t)(n) << INT_PRISS_PRI6SS_SHIFT)
#define INT_PRISS_PRI7SS_SHIFT       (28)      /* Bits 28-31: Interrupt with Priority Level 7 Shadow Set bits */
#define INT_PRISS_PRI7SS_MASK        (15 << INT_PRISS_PRI7SS_SHIFT)
#  define INT_PRISS_PRI7SS(n)        ((uint32_t)(n) << INT_PRISS_PRI7SS_SHIFT)

/* Interrupt status register */

#define INT_INTSTAT_SIRQ_SHIFT       (0)       /* Bits 0-7: Last Interrupt Request Serviced Status */
#define INT_INTSTAT_SIRQ_MASK        (0xff << INT_INTSTAT_SIRQ_SHIFT)
#define INT_INTSTAT_SRIPL_SHIFT      (8)       /* Bits 8-10: Requested Priority Level (Single Vector Mode) */
#define INT_INTSTAT_SRIPL_MASK       (7 << INT_INTSTAT_SRIPL_SHIFT)

/* Interrupt proximity timer register -- This register contains a 32-bit
 * reload value with no field definitions.
 */

/* Interrupt flag status register 0-5 and Interrupt enable control register 0-5
 * Contains interrupt status/control bits, one for each interrupt:
 *
 *  IFS0/IEC0 - Interrupts 0-31
 *  IFS1/IEC1 - Interrupts 32-63
 *  IFS2/IEC2 - Interrupts 64-95
 *  IFS3/IEC3 - Interrupts 96-127
 *  IFS4/IEC4 - Interrupts 128-159
 *  IFS5/IEC5 - Interrupts 160-190
 */

/* Interrupt priority control register 0-47 */

#define INT_IPC_DISABLED             0     /* Disabled! */
#define INT_IPC_MIN_PRIORITY         1     /* Minimum (enabled) priority */
#define INT_IPC_MID_PRIORITY         4     /* Can be used as the default */
#define INT_IPC_MAX_PRIORITY         7     /* Maximum priority */

/* Each of the 48 IPC register contains controls for 4 interrupts */

#define INT_IPC_REGNDX(n)           ((n) >> 2)
#define INT_IPC_REGOFFSET(n)        ((n) & 3)
#define INT_IOC_REGADDR(n)          PIC32MZ_INT_IPC(INT_IPC_REGNDX(n))

/* Interrupt sub-priority (IS) field is aligned at bits 0, 8, 16, and 24 in
 * each IPC register
 */

#define INT_IPC_MIN_SUBPRIORITY      0     /* Minimum sub-priority */
#define INT_IPC_MAX_SUBPRIORITY      0     /* Maximum sub-priority */

#define INT_IPC_IS_SHIFT(n)         (INT_IPC_REGOFFSET(n) << 3)
#define INT_IPC_IS_MASK(n)          (3 << INT_IPC_IS_SHIFT(n))

/* Interrupt priority (IP) field is aligned at bits 2, 10, 18, and 26 in
 * each IPC register
 */

#define INT_IPC_IP_SHIFT(n)         (2 + (INT_IPC_REGOFFSET(n) << 3))
#define INT_IPC_IP_MASK(n)          (7 << INT_IPC_IP_SHIFT(n))

/* Interrupt vector n address address offset, n=0-190 */

#define INT_OFF_VOFF_SHIFT          (0)      /* Bits 1-17: Interrupt vector address offset */
#define INT_OFF_VOFF_MASK           (0x3fffe << INT_OFF_VOFF_SHIFT)

/****************************************************************************
 * Public Types
 ****************************************************************************/

#ifndef __ASSEMBLY__

/****************************************************************************
 * Inline Functions
 ****************************************************************************/

/****************************************************************************
 * Public Function Prototypes
 ****************************************************************************/

#ifdef __cplusplus
#define EXTERN extern "C"
extern "C"
{
#else
#define EXTERN extern
#endif

#undef EXTERN
#ifdef __cplusplus
}
#endif

#endif /* __ASSEMBLY__ */
#endif /* __ARCH_MIPS_SRC_PIC32MZ_HARDWARE_INT_H */
